Import numpy and pandas

In [1]:
import numpy as np
import pandas as pd

Create a python dictionary with 3 labels and 3 numbers of your choice.
Call it my_data.

In [2]:
my_data = {'Brazil': 5, 'Italia': 4, 'Argentina': 3}
my_data

{'Brazil': 5, 'Italia': 4, 'Argentina': 3}

Create a pandas Series from the my_data dictionary, called my_series.
Display it.

In [3]:
my_series = pd.Series(my_data)
my_series

Brazil       5
Italia       4
Argentina    3
dtype: int64

Create a 5x5 array of random integers, from 0 to 100 called nums.
Display it.

In [4]:
nums = np.random.randint(0, 100, size=(5, 5))
nums

array([[42, 16, 52, 29, 90],
       [75, 69, 66, 96, 40],
       [76,  5, 82, 64, 94],
       [43, 91, 89, 91, 74],
       [23, 29,  4, 80, 43]])

Create a DataFrame from the nums array, called df.
Label the columns: A,B,C,D,E
Label the index: V,W,X,Y,Z
Display the DataFrame.

In [5]:
df = pd.DataFrame(nums, index=["V","W","X","Y","Z"], columns=["A","B","C","D","E"])
df

    A   B   C   D   E
V  42  16  52  29  90
W  75  69  66  96  40
X  76   5  82  64  94
Y  43  91  89  91  74
Z  23  29   4  80  43

Display columns B and D.

In [6]:
df[['B','D']]

    B   D
V  16  29
W  69  96
X   5  64
Y  91  91
Z  29  80

Display rows X and Y.

In [7]:
df.loc[['X','Y']]

    A   B   C   D   E
X  76   5  82  64  94
Y  43  91  89  91  74

Display element YC.

In [8]:
df.loc['Y','C']

89

Display rows X and Y, and columns B and D.

In [9]:
df.loc[['X','Y'],['B','D']]

    B   D
X   5  64
Y  91  91

Display the rows where the number in the 'A' column is greater than 50.

In [19]:
df[df['A'] > 50]

    A   B   C   D   E
W  75  69  66  96  40
X  76   5  82  64  94

In [31]:
df[(df['A'] > 50) & (df['B'] < 10)]

    A  B   C   D   E
X  76  5  82  64  94

Add a new column F, which is column A x column B.
Display the resulting DataFrame.

In [20]:
df['F'] = df['A'] * df['B']
df

    A   B   C   D   E     F
V  42  16  52  29  90   672
W  75  69  66  96  40  5175
X  76   5  82  64  94   380
Y  43  91  89  91  74  3913
Z  23  29   4  80  43   667

Permanently drop row V and column F.
Display the resulting DataFrame.

In [21]:
df.drop('V', axis=0, inplace=True)
df.drop('F', axis=1, inplace=True)
df

    A   B   C   D   E
W  75  69  66  96  40
X  76   5  82  64  94
Y  43  91  89  91  74
Z  23  29   4  80  43

Save the dataframe in a file called 'data10.csv'

In [22]:
df.to_csv('data10.csv')